Week 6/Day 1/video-games-tournament-master/app/controllers/tournaments_controller.rb

SELECT "tournaments".* FROM "tournaments"
---
  def api
  	tournaments = Tournament.all

INSERT INTO "tournaments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Baseball"], ["created_at", "2016-05-02 22:20:10.442634"], ["updated_at", "2016-05-02 22:20:10.442634"]]
---
  def create
  	new_tournament = Tournament.create(tournament_params)

SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" IS NULL LIMIT 1
---
  def delete
  	tournament = Tournament.find_by(id: params[:id])